/**
  * Created by wqj on 2019/5/8.
 */
#include <stdio.h>
/**
 *  &    按位与     两个位置是1 才为1
 *  |    按位或     只要一个位置为1就位1
 *  ^    按位异或    如果两个位置相同则为1,不同则为1
 *  ~    取反         对二进制取反1变0,0变1 (最高位0就是正数,1就是负数)
 *  <<   左移         将二进制全部左移N位 高位丢弃,低位补0
 *  >>   右移         讲一个数右移N位,移到低位舍弃,高位补0
 * */
int main(int argc,char *argv[]){


    /**
     * 与运算
     * */
     int a=5;//0101
     int b=9;//1001
     printf("9&5:%d\n",a&b);

     /**
      * 或运算
      * */
     int c=13;//1101
     int d=2;//0010
     printf("13|2:%d\n",c|d);

     /**
      * 异或运算(只有位置相关才为1,不然为0)
      * */
     int e=13;//1101
     int f=4; // 0100
     printf("13^4:%d\n",e^f);


     /**
      * 取反  (加1取反)
      * */
     int g=2;//10
     int k=-4;//10000000 00000000 00000000 00000100
     printf("正数取反~2:%d,负数取反~-3:%d\n",~g,~k);

     /**
      * 左移
      * */
      int i=5 ;//101
      printf("5<<2:%d\n",i<<2);//10100

      /**
       * 右移
       * */
       int j=20;//10100
       printf("20>>2:%d\n",j>>2); //00101
       printf("20>>4:%d\n",j>>4); //00001
}
